# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 181 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 181 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 231 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 357 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 357 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# Khai báo 2 module tùy biến
# ------------------------- BACKBONE -------------------------
backbone:
  - [-1, 1, nn.Identity,       []]        # 0 : raw image
  - [-1, 1, SpatialTransformer,[3]]       # 1 : STN (c_in=3)
  - [-1, 1, Conv,              [64,  3, 2]]   # 2 : stride-2  →  P1/2
  - [-1, 1, Conv,              [128, 3, 2]]   # 3 : stride-4
  - [-1, 2, C3k2,              [256, False, 0.25]]  # 4 : stride-4
  - [-1, 1, Conv,              [256, 3, 2]]   # 5 : stride-8   (P3/8)
  - [-1, 2, C3k2,              [512, False, 0.25]]  # 6 : stride-8
  - [-1, 1, Conv,              [512, 3, 2]]   # 7 : stride-16  (P4/16)
  - [-1, 2, C3k2,              [512, True]]          # 8 : stride-16
  - [-1, 1, Conv,              [1024,3, 2]]   # 9 : stride-32  (P5/32)
  - [-1, 2, C3k2,              [1024,True]]         # 10: stride-32
  - [-1, 1, SPPF,              [1024,5]]            # 11: stride-32
  - [-1, 2, C2PSA,             [1024]]              # 12: stride-32 (P5_out)

# --------------------------- HEAD ---------------------------
head:
  # P5/32 → upsample → concat P4/16
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]          # 13: stride-16
  - [[-1, 8], 1, Concat, [1]]                           # 14: concat(13, P4=8)
  - [-1, 2, C3k2, [512, False]]                         # 15: stride-16

  # P4_fuse/16 → upsample → concat P3/8
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]          # 16: stride-8
  - [[-1, 6], 1, Concat, [1]]                           # 17: concat(16, P3=6)
  - [-1, 2, C3k2, [256, False]]                         # 18: stride-8

  # P3_fuse/8 → down 2× → concat với P4_fuse/16
  - [-1, 1, Conv,  [256, 3, 2]]                         # 19: stride-16
  - [[-1, 15], 1, Concat, [1]]                          # 20: concat(19, 15)
  - [-1, 2, C3k2, [512, False]]                         # 21: stride-16

  # P4_refined/16 → down 2× → concat với P5_out/32
  - [-1, 1, Conv,  [512, 3, 2]]                         # 22: stride-32
  - [[-1, 12], 1, Concat, [1]]                          # 23: concat(22, 12)
  - [-1, 2, C3k2, [1024, True]]                         # 24: stride-32

  # Detect head (P3/8, P4/16, P5/32)
  #- [ [ 17, 20, 23 ], 1, Detect, [ nc ] ] # Detect(P3, P4, P5)
  - [[17, 20, 23], 1, DetectSDTN, [nc]]                 # 25